---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralBeamEnd0Elevation
source: html/072117e6-ea6e-6eb9-45bd-698450ebe50d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralBeamEnd0Elevation Property

"Start Level Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralBeamEnd0Elevation { get; }
```